tutorials/incompressible/icoDyMFoam/turboPassageRotating/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;

        minIter         0;
        maxIter         1000;
        tolerance       0.0;
        relTol          0;
    }
    p
    {
        solver          PCG;
        preconditioner  DIC;

        minIter         0;
        maxIter         1000;
        tolerance       1e-07;
        relTol          0;
    }
    pFinal
    {
        solver          PCG;
        preconditioner  DIC;

        minIter         0;
        maxIter         1000;
        tolerance       1e-07;
        relTol          0;
    }
    U
    {
        solver          BiCGStab;
        preconditioner  DILU;

        minIter         0;
        maxIter         1000;
        tolerance       1e-07;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
