tutorials/incompressible/icoDyMFoam/turboPassageRotating/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

globalFaceZones
(
    interface1_faces
    interface2_faces
    rotor_cyclic_upper_faces
    rotor_cyclic_lower_faces
);  // Those are the names of the face zones created previously

numberOfSubdomains 4;

method          scotch;

simpleCoeffs
{
     n               (2 2 1);
     delta           0.001;
}

distributed     no;

roots
(
);

// ************************************************************************* //
